{
	"opening": "Hello there!",
	"greetings": "My name is \n<b class=\"disableTransition\">Tomasz Sroka </b>, you are currently seeing my first personal website. The idea behind the project was to create a simple and clear portfolio site where I could introduce myself. I used Vue 3 for this purpose. As you know, this is not the best way when it comes to creating static pages, but the main reason for choosing it was to test my skills in this framework. I am a frontend developer gathering commercial experience for over 2 years, so far working mainly with javascript, html, css and many derivatives. In the projects tab you can find the most up-to-date works made by me and at least mostly look inside them thanks to github. The left menu (upper in the mobile view) is used to change the language or colors displayed on the page. Additional tabs are used to get to know my hobbies and learn something about me. In the contact tab there are basic contact details for me. Enjoy your stay &#128512;",
	"contactHeader": "Contact:",
	"livingPlace": "Currently living in: \n<b>Cracow</b>",
	"contact-form-header": "Do You need any further information? \n<br /> Write your message bellow and send it directly to me &#128512;",
	"contact-text-placeholder": "Input your message",
	"contact-email-placeholder": "Your email",
	"weatherApp-vue": "WeatherApp in Vue + Tailwind",
	"portfolio-vue": "Portfolio in Vue.js",
	"quizz-react": "Quizz in React",
	"calculator-js": "EcoCalculator in Vanilla Js",
	"landing-nuxt": "Landing in Nuxt.js",
	"landing-vue": "Landing in Vue.js",
	"travel": "Traveling",
	"games": "Board games",
	"sightseeing": "Sightseeing",
	"music": "Music",
	"university": "Cracow University of Technology",
	"it-bechelor-dates": "October 2017 - January 2021",
	"it-master-dates": "February 2021 - September 2022",
	"re-bechelor-dates": "September 2022 - now",
	"bechelor": "Bechelor Degree",
	"master": "Master Degree",
	"field": "Field of study:",
	"res": "Renewable energy sources",
	"it": "IT",
	"spec": "Spec: Data Science",
	"shop":"Simple store",
	"shop-desc":"Store made using Nuxt 3, Pinia and tailwind. An open source 'factestore' API was used, from which products and categories are imported. In the future, a backend will be provided to handle user registration, adding/removing products and allow the apllication to be used like a real store.",
	"foodity":"recipe finder",
	"foodity-desc":"Web application for finding recipes using Vue 3, Vuex, Vue router and Tailwind",
	"users":"Users organizer",
	"users-desc":"Small list design for user management, allows you to edit, delete and create new users. A free open API was used that retur real answers after sending the appropriate data",
	"lively-desc": "Specialists in the online world.",
	"tuoglos-desc": "A group of 133 websites uniting Poles in the country and abroad.",
	"lively-dates": "March 2021 - now",
	"tuoglos-dates": "September 2020 - November 2020",
	"contactAlert": "This section is currently turned off",
	"send": "send",
	"menu": {
		"home": "Home",
		"about": "About me",
		"projects": "Projects",
		"skills": "Skills",
		"contact": "Contact"
	},
	"about": {
		"university": "University",
		"experience": "Experience",
		"hobbies": "Hobbies"
	},
	"project-link": "View",
	"livelyExperience": {
		"projects": "Execution of projects in accordance with the client's guidelines",
		"forms": "Making forms, lists, planners, agendas",
		"wordpress": "Creating pages mostly (but not only) based on wordpress",
		"mails": "Preparation of email templates",
		"conservation": "Maintaining multiple websites"
	},
	"tuOglos": {
		"vueLanding": "Preparation of a landings page using Vue 3/Nuxt.js",
		"landing": "Creating simple landing pages"
	},
	"weatherApp-desc": "A simple weather application using Vue 3 and Tailwind, used to search for Polish cities and display hourly/daily and current weather for them. It also allows you to cache the city you are watching and displays a shortcut to detailed weather on the home screen.",
	"quizz-desc": "Quiz created with React.js. The application sends a request to the Api with questions based on the completed form, then presents tiles with questions to be answered. At the end it is possible to check your answers, start the quiz again with the current settings or return to the form.",
	"portfolio-desc": "Portfolio website made using Vue.js without using a router. CSS written according to BEM rules. The project serves as a page telling about the author, allows you to get to know me better, check projects, and provides social links with contact information.",
	"ecocalculator-desc": "Eco calculator written in Vanilla.js. The application is used to calculate CO2 consumption during the conference, it also allows you to compare various forms of events and their CO2 emissions.",
	"landingVue-desc": "Simple landing in Vue 3",
	"landingNuxt-desc": "Simple landing in Nuxt.js"
}
