{
	"opening": "Hejka!",
	"greetings": "Nazywam się \n<b class=\"disableTransition\">Tomasz Sroka</b>, aktualnie widzisz moją pierwszą osobistą stronę internetową. Ideą projektu było stworzenie prostej i przejrzystej witryny pełniącej rolę portfolio, na której mógłbym przedstawić siebie. Użyłem do tego celu Vue 3. Jak wiadomo nie jest to najlepszy sposób jeśli chodzi o tworzenie statycznych stron, głównym powodem wyboru było jednak sprawdzenie swoich umiejętności w tym frameworku. Jestem frontend developerem zbierającym doświadczenie komercyjne od ponad 2 lat, do tej pory pracującym głównie z javascript, html, css i wieloma pochodnymi. W zakładce projekty można znaleźć najbardziej aktualne wykonane przezemnie prace i przynajmniej w większości zaglądnąć do ich wnętrza dzięki githubowi. Lewe menu (w widoku mobilnym górne) służy do zmiany języka lub kolorów wyświetlanych na stronie. Dodatkowe zakładki służą do tego, żeby poznać moje hobby i dowiedzieć się czegoś o mnie. W zakłądce kontaktu podane są podstawowe dane kontaktowe do mnie. Miłego pobytu &#128512;",
	"contactHeader": "Kontakt:",
	"livingPlace": "Aktualnie mieszkam w: \n<b>Kraków</b>",
	"contact-form-header": "Potrzebujesz więcej informacji? \n<br /> Napisz wiadomość poniżej i wyślij ją do mnie &#128512;",
	"contact-text-placeholder": "Wpisz wiadomość",
	"contact-email-placeholder": "Twój email",
	"weatherApp-vue": "Aplikacja pogodowa w Vue + Tailwind",
	"portfolio-vue": "Portfolio w Vue.js",
	"quizz-react": "Quizz w React",
	"calculator-js": "EkoKalkulator w Vanilla Js",
	"landing-nuxt": "Landing w Nuxt.js",
	"landing-vue": "Landing w Vue.js",
	"travel": "Podróże",
	"games": "Gry planszowe",
	"sightseeing": "Zwiedzanie",
	"music": "Muzyka",
	"university": "Politechnika Krakowska",
	"it-bechelor-dates": "październik 2017 - luty 2021",
	"it-master-dates": "luty 2021 - wrzesień 2022",
	"re-bechelor-dates": "wrzesień 2022 - teraz",
	"bechelor": "Studia inżynierskie",
	"master": "Studia magisterskie",
	"field": "Kierunek:",
	"res": "Odnawialne źródła energii",
	"it": "Informatyka",
	"spec": "Specjalizacja: Data science",
	"shop":"Prosty sklep",
	"shop-desc":"Sklep wykonany przy użyciu Nuxt 3, Pinia i tailwind. Wykorzystane zostało otwarte API 'fakestore', z którego importowane są produkty oraz kategorie. W przyszłości wykonany zostanie backend, który będzie obsługiwał rejestrację użytkowników, dodawanie/usuwanie produktów i umożliwi korzystanie z apliakcji jak prawdziwego sklepu.",
	"foodity":"Wyszukiwarka przepisów",
	"foodity-desc":"Aplikacja webowa do wyszukiwania przepisów na potrawy z wykorzystaniem Vue 3, Vuex, Vue router i Tailwind",
	"users":"Zarządzanie użytkownikami",
	"users-desc":"Mały projekt listy do zarządzania użytkownikami, pozwala na edycję, usuwanie oraz tworzenie nowych użytkowników. Wykorzystane zostało darmowe otwarte API zwracające prawdziwe odpowiedzi po wysłaniu odpowiednich danych",
	"lively-desc": "Specjaliści od świata online.",
	"tuoglos-desc": "Grupa 133 portali łącząca Polaków w Polsce i na całym świecie",
	"lively-dates": "marzec 2021 - teraz",
	"tuoglos-dates": "wrzesień 2020 - listopad 2020",
	"contactAlert": "Ta sekcja aktualnie jest wyłączona",
	"send": "wyślij",
	"menu": {
		"home": "Strona główna",
		"about": "O mnie",
		"projects": "Projekty",
		"skills": "Technologie",
		"contact": "Kontakt"
	},
	"about": {
		"university": "Wykształcenie",
		"experience": "Doświadczenie",
		"hobbies": "Zainteresowania"
	},
	"project-link": "Zobacz",
	"livelyExperience": {
		"projects": "Wykonywanie projektów zgodnie z wytycznymi klienta",
		"wordpress": "Tworzenie stron głównie (ale nie tylko) w oparciu o wordpress",
		"forms": "Wykonywanie formularzy, list, planerów, agend",
		"mails": "Przygotowywanie szablonów maili",
		"conservation": "Utrzymanie wielu stron internetowych"
	},
	"tuOglos": {
		"vueLanding": "Przygotowanie landingów z wykorzystaniem Vue 3/Nuxt.js",
		"landing": "Tworzenie prostych landingów"
	},
	"weatherApp-desc": "Prosta aplikacja pogodowa z wykorzystaniem Vue 3 i Tailwind, służąca do wyszukiwania polskich miast oraz wyświetlania dla nich godzinowej/dniowej oraz aktualnej pogody. Umożliwia ona również zapisanie w pamięci podręcznej obserwowanego miasta oraz wyświetla skrót do szczegółowej pogody na ekranie głównym",
	"quizz-desc": "Quizz stworzony przy pomocy React.js. Aplikacja wysyła zapytanie do Api z pytaniami na podstawie wypełnionego formularza, następnie przedstawia kolejny płytki z pytaniami, na które należy odpowiedzieć. Na końcu możliwe jest sprawdzenie swoich odpowiedzi, rozpoczęcie quizzu ponownie z obecnymi ustawieniami lub powrót do formularza.",
	"portfolio-desc": "Strona portfolio wykonana przy użyciu Vue.js bez wykorzystania routera. CSS napisany zgodnie z zasadami BEM. Projekt służy jako strona opowiadająca o autorze, umożliwia poznanie mnie lepiej, sprawdzenie projektów, udostępnia również linki społecznościowe i informacje kontaktowe.",
	"ecocalculator-desc": "Eko kalkulator napisany w Vanilla.js. Aplikacja służy do obliczania zużycia CO2 w trakcie konferencji, umożliwia także porównianie różnych form eventów i ich emisji CO2.",
	"landingVue-desc": "Prosty landing w Vue 3",
	"landingNuxt-desc": "Prosty landing w Nuxt.js"
}
